tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "instantclienttap/instantclient"
cask "adoptopenjdk8"
brew "ack"
brew "annie"
brew "sqlite"
brew "python"
brew "ansible"
brew "ansible-cmdb"
brew "aria2"
brew "autoconf"
brew "autojump"
brew "automake"
brew "bash"
brew "bash-completion@2"
brew "bash-git-prompt"
brew "bfg" #TODO
brew "icu4c"
brew "gettext"
brew "libffi"
brew "pcre"
brew "ccat"
brew "cheat"
#TODO
brew "checkstyle" 
brew "cloc"
brew "clojure"
brew "cmake"
brew "coreutils"
brew "dark-mode"
brew "libgcrypt"
brew "libksba"
brew "dns2tcp"
brew "dos2unix"
brew "libexif"
brew "popt"
brew "exif"
brew "exiftags"
brew "fd"
brew "libevent"
brew "lame"
brew "ffmpeg"
brew "findutils"
brew "fzf"
brew "gcc"
brew "git-flow-avh"
brew "git-lfs"
brew "gnu-sed"
brew "gnu-tar"
brew "libusb"
brew "gnupg"
brew "go"
brew "gradle"
brew "grep"
brew "gron"
brew "groovy"
brew "node"
brew "httpdiff"
brew "httpie"
brew "httping"
brew "httpry"
brew "httpstat"
brew "hub"
brew "icdiff"
brew "libtool"
brew "imagemagick"
brew "iproute2mac"
brew "javarepl"
brew "jenv"
brew "jid"
brew "oniguruma"
brew "jq"
brew "leiningen"
brew "libusb-compat"
brew "libuv"
brew "libxml2"
brew "loc"
brew "lynx"
brew "mackup"
brew "mas"
brew "maven"
brew "mhash"
brew "mcrypt"
brew "moreutils"
brew "mr"
brew "mysql@5.6"
brew "neovim"
brew "nghttp2"
brew "nvm"
brew "openssh"
brew "pkg-config"
brew "pmd"
brew "privoxy"
brew "putty"
brew "pv"
brew "q"
brew "recode"
brew "redis"
brew "rename"
brew "ripgrep"
brew "ruby", link: true
brew "scala"
brew "shellcheck"
brew "speedtest-cli"
brew "spotbugs"
brew "sqlmap"
brew "ssh-copy-id"
brew "testssl"
brew "textql"
brew "the_silver_searcher"
brew "tmux"
brew "tomcat@8"
brew "tree"
brew "typescript"
brew "unixodbc"
brew "utf8proc"
brew "w3m"
brew "wget"
brew "xsv"
brew "you-get"
brew "youtube-dl"
#TODO manually download
#brew "instantclienttap/instantclient/instantclient-basic", link: false 
#brew "instantclienttap/instantclient/instantclient-sdk"
#brew "instantclienttap/instantclient/instantclient-sqlplus"
cask "aerial"
cask "alfred"
cask "appcleaner"
cask "atom"
cask "beyond-compare"
cask "cakebrew"
cask "ccleaner"
cask "daisydisk"
cask "day-o"
cask "devdocs"
cask "devonthink"
cask "disk-inventory-x"
cask "docker"
cask "dropbox"
cask "duet"
cask "evernote"
cask "firefox"
cask "font-d2coding"
cask "geektool"
cask "gifcapture"
cask "google-photos-backup-and-sync"
cask "handbrake"
cask "hyper"
cask "iina"
cask "imageoptim"
cask "kap"
cask "kensington-trackball-works"
cask "lepton"
cask "loading"
cask "macdown"
cask "marp"
cask "mojibar"
cask "mysqlworkbench"
cask "ngrok"
cask "notion"
cask "nvalt"
cask "opera"
cask "p4v"
cask "pdf-expert"
cask "plistedit-pro"
cask "postman"
cask "proxyman"
cask "qblocker"
cask "qdesktop"
cask "rescuetime"
cask "save-hollywood"
cask "scroll-reverser"
cask "shuttle"
cask "slack"
cask "sourcetree"
cask "stand"
cask "steam"
cask "telegram-desktop"
cask "tickeys"
cask "timings"
cask "typora"
cask "vagrant"
cask "vagrant-manager"
cask "vimr"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "vmware-horizon-client"
cask "wordpresscom"
cask "xnviewmp"
mas "AppLocker", id: 1132845904
mas "Apps on Sale", id: 448002467
mas "ArcSoft Photo+", id: 628703558
mas "Battery Indicator", id: 1206020918
mas "Better Rename 9", id: 414209656
mas "Day One Classic", id: 422304217
mas "Divvy", id: 413857545
mas "EasyRes", id: 688211836
mas "EasyWebBrowser", id: 829422862
mas "Fantastical 2", id: 975937182
mas "ForkLift", id: 412448059
mas "Gemini", id: 463541543
mas "GIF Brewery 3", id: 1081413713
mas "GIPHY CAPTURE", id: 668208984
mas "JustFocus", id: 1142151959
mas "KakaoTalk", id: 869223134
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Mactracker", id: 430255202
mas "Movist", id: 461788075
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PhotoScapeX", id: 929507092
mas "Pine Player", id: 1112075769
mas "PopClip", id: 445189367
mas "QuickShot", id: 965442961
mas "Trello", id: 1278508951
mas "Tweetbot", id: 557168941
mas "VOX", id: 461369673
mas "Wunderlist", id: 410628904
mas "Yoink", id: 457622435

#US account
mas "Deckset", id: 847496013
mas "Did I Click", id: 555241974
mas "iA Writer", id: 775737590
mas "iThoughtsX", id: 720669838
mas "Notability", id: 736189492
mas "Tumblelog Picture Archiver", id: 702387412
mas "TumblrVideoBrowser", id: 866376427
mas "whereismymouse", id: 887893671
mas "Yet Comic Reader", id: 934751602
