tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
brew "sqlite"
brew "xz"
brew "ansible"
brew "argocd"
brew "git"
brew "asdf"
brew "python@3.10"
brew "autojump"
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "ccat"
brew "cloc"
brew "convmv"
brew "coreutils"
brew "fzf"
brew "kubernetes-cli"
brew "tmux"
brew "dkosctl"
brew "dos2unix"
brew "exif"
brew "exiftags"
brew "exiftool"
brew "fd"
brew "harfbuzz"
brew "ffmpegthumbnailer"
brew "findutils"
brew "fortio"
brew "gh"
brew "git-flow-avh"
brew "git-lfs"
brew "gnu-sed"
brew "gnu-tar"
brew "icu4c@76"
brew "openjdk"
brew "gradle"
brew "grep"
brew "httpie"
brew "httping"
brew "httpry"
brew "httpstat"
brew "hub"
brew "icdiff"
brew "imagemagick"
brew "jd"
brew "jemalloc"
brew "jenv"
brew "jq"
brew "kcat"
brew "kustomize"
brew "llm"
brew "loc"
brew "mackup"
brew "node", link: false
brew "marp-cli"
brew "mas"
brew "maven"
brew "moreutils"
brew "neovim"
brew "nvm"
brew "ollama"
brew "pkgconf"
brew "poppler"
brew "pv"
brew "pyenv"
brew "q"
brew "recode"
brew "redis"
brew "rename"
brew "ripgrep"
brew "ruby"
brew "shellcheck"
brew "siege"
brew "sqlite-analyzer"
brew "ssh-copy-id"
brew "superfile"
brew "tcping"
brew "testssl"
brew "textql"
brew "the_silver_searcher"
brew "tldr"
brew "tokei"
#brew "tomcat@8"
brew "tomcat@9"
brew "tree"
brew "unar"
brew "uv"
brew "wget"
brew "xsv"
brew "yazi"
brew "you-get"
brew "youtube-dl"
brew "yt-dlp"
brew "zoxide"
cask "aldente"
cask "alfred"
cask "appcleaner"
cask "arc"
cask "beyond-compare"
cask "brave-browser"
cask "claude"
cask "clipy"
cask "cursor"
cask "daisydisk"
cask "dash"
cask "day-o"
cask "devonthink"
cask "digikam"
cask "docker"
cask "dozer"
cask "dropbox"
cask "exifrenamer"
cask "firefox"
cask "font-cascadia-code"
cask "font-d2coding"
cask "font-d2coding-nerd-font"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-nanum-gothic"
cask "font-symbols-only-nerd-font"
cask "geektool"
cask "google-chrome"
cask "google-drive"
cask "gureumkim"
cask "handbrake"
cask "iterm2"
cask "jdk-mission-control"
cask "jetbrains-toolbox"
cask "kap"
cask "karabiner-elements"
cask "keka"
cask "memoryanalyzer"
cask "movist-pro"
cask "ollamac"
cask "omnissa-horizon-client"
cask "openinterminal-lite"
cask "pdf-expert"
cask "postman"
cask "rapidapi"
cask "rescuetime"
cask "slack"
cask "sourcetree"
cask "steam"
cask "temurin@21"
cask "visual-studio-code"
cask "visualvm"
cask "xnconvert"
cask "xnviewmp"
cask "zen"
cask "zoom"
cask "zulip"
#mas "Actions", id: 1586435171
#mas "Amphetamine", id: 937984704
#mas "AppLocker", id: 1132845904
#mas "ArcSoft Photo+", id: 628703558
#mas "Better Rename 9", id: 414209656
#mas "Checkor", id: 1238750814
#mas "Color Picker", id: 1545870783
#mas "Command X", id: 6448461551
mas "Dato", id: 1470584107
#mas "Day One", id: 1055511498
#mas "Divvy", id: 413857545
#mas "EasyRes", id: 688211836
#mas "Everlog", id: 1519935634
#mas "Fantastical", id: 975937182
#mas "Folder Peek", id: 1615988943
#mas "ForkLift", id: 412448059
#mas "fullmoon", id: 6727014156
#mas "Gemini", id: 463541543
#mas "Gifski", id: 1351639930
mas "Hancom Office HWP Viewer", id: 416746898
#mas "HEIC Converter", id: 1294126402
#mas "Hyperduck", id: 6444667067
#mas "iA Writer", id: 775737590
#mas "Jiffy", id: 1502527999
#mas "KakaoTalk", id: 869223134
#mas "Keynote", id: 409183694
#mas "LINE", id: 539883307
#mas "Melon", id: 1236050766
#mas "Microsoft To Do", id: 1274495053
#mas "Monosnap", id: 540348655
#mas "Notability", id: 736189492
#mas "Numbers", id: 409203825
#mas "Okta Verify", id: 490179405
#mas "One Thing", id: 1604176982
#mas "Pandan", id: 1569600264
#mas "Pasteboard Viewer", id: 1499215709
#mas "Perplexity", id: 6714467650
mas "PhotoScape X", id: 929507092
#mas "Pixave", id: 924891282
#mas "Plain Text Editor", id: 1572202501
#mas "Plash", id: 1494023538
#mas "PopClip", id: 445189367
mas "Private Browser", id: 829422862
#mas "Pure Paste", id: 1611378436
#mas "Refined GitHub", id: 1519867270
mas "Screenie", id: 965442961
#mas "Shareful", id: 1522267256
#mas "Soulver 2", id: 413965349
#mas "Speediness", id: 1596706466
mas "The Unarchiver", id: 425424353
#mas "Today", id: 6443714928
mas "Trello", id: 1278508951

mas "Tumblelog Picture Archiver", id: 702387412
mas "UTC Time", id: 1538245904
#mas "Velja", id: 1607635845
mas "Video Crawler for Tumblr", id: 866376427
mas "Yet Comic Reader", id: 934751602
mas "Yoink", id: 457622435
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "marp-team.marp-vscode"
